## Day 1: Python Fundamentals

### Introduction

In [498]:
5 + 3

8

In [499]:
def greet(name): # Simple function to greet a person
    return f"Hello, {name}!"

greet('Jia')

'Hello, Jia!'

In [500]:
5 - 3

2

In [501]:
5 / 3

1.6666666666666667

In [502]:
5 ** 3

125

In [503]:
5 % 2

1

In [504]:
5 * (10 - 3)

35

In [505]:
from numpy import sqrt

sqrt(4)  # Returns 2.0

np.float64(2.0)

In [506]:
####### This is a comment 

x = 1 # This is a comment

# Any text preceded by a hash is ignored by Python

In [507]:
True != False

True

In [508]:
import numpy as np

x = sqrt(9)


# If statement
if x > 0:
    print("Positive")


print(x)

Positive
3.0

In [509]:
x

np.float64(3.0)

### Modules and Packages

In [510]:
# earlier, we imported the sqrt function from the NumPy package

# we can import the whole package
import numpy as np #this is a common importing standard 

# You can also use the dot notation to access functions
np.sqrt(4)

np.float64(2.0)

In [511]:
from numpy import sqrt 

sqrt(4) 

#OR 

import numpy as np 

np.sqrt(4)

np.float64(2.0)

In [512]:
np.log(1)

np.float64(0.0)

Python packages are a collection of useful tools developed by the open-source community. They extend the capabilities of the python language. To install a new package (for example, pandas), you can go to your command prompt and type in pip install pandas. Once a package is installed, you can import it as follows.

External packages are typically installed from public repositories, such as the Python Package Index (PyPI) and conda-forge, as follows:

- From PyPI: `pip install <package_name>`
- From conda-forge: `conda install <package_name>`

A good practice is to install required packages into a virtual environment.

In [513]:
# Install single package
# These should be ran in your terminal, not in Jupyter Notebook
#pip install pandas

# Install specific version
#pip install pandas==1.5.3

# Install with version range
#pip install "pandas>=1.5.0,<2.0.0"

# Install multiple packages
#pip install pandas numpy matplotlib

# To check the entire list of your packages, run:
# conda list 

# To check which kernels are available 
# conda env list

# To see which environment you're currently in:
# which python    # On Unix/MacOS
# where python    # On Windows

# To switch kernels/environments 
# conda activate environment_name    # Switch to a specific environment
# conda deactivate                  # Switch back to base environment

In [514]:
### Let's install this package:
### pip install kagglehub

In [515]:
# import the external package Pandas and give it the conventional alias `pd`
import pandas as pd

In [516]:
import numpy as np

In [517]:
np.power(10, 5)

np.int64(100000)

In [518]:
np.log10(9)

np.float64(0.9542425094393249)

### Variables and Objects

Python is an object-oriented programming (OOP) language. Everything in Python is an object of a certain class.

In [519]:
# assign the sum of 5 and 3 to the variable result
result = 5 + 3
result

8

In [520]:
print(result)

8

In [521]:
result = 5 - 3
result

2

In [522]:
viktoria = 'instructor'
viktoria

'instructor'

In [523]:
viktoria = 'student'
viktoria

'student'

In [524]:
Result = '5'
Result

'5'

In [525]:
result

2

In [526]:
type(result)

int

In [527]:
type(5)

int

In [528]:
type(Result)

str

In [529]:
type(sqrt)

numpy.ufunc

In [530]:
from math import sqrt

type(sqrt)

builtin_function_or_method

In [531]:
np.sqrt(2)

np.float64(1.4142135623730951)

In [532]:
type(True)

bool

In [533]:
type(5.6)

float

In [534]:
np.sqrt(-9)

/var/folders/jn/k87rrm694dq263mh4gqmfd080000gn/T/ipykernel_45030/2149185541.py:1: RuntimeWarning: invalid value encountered in sqrt
  np.sqrt(-9)

np.float64(nan)

### Python Data Structures: Lists, Dictionaries, (+ Tuples, and Sets)

Lists, dictionaries, tuples, and sets are built-in Python data structures. In this course, we primarily use them to manipulate inputs to and outputs from data structures and models in external packages. However, understanding them is critical for effective Python use. External packages come and go. Knowing how to use the built-in data structures enables you to pick up new data analysis packages and infrastructure paradigms more easily.

**List**

In [535]:
# Creation
numbers = [1, 2, 3, 4, 5]
mixed = [1, "hello", 3.14, True]

# Indexing and Slicing
first = numbers[0]        # First element (1)
last = numbers[-1]        # Last element (5)
subset = numbers[1:4]     # Elements 1 through 3 [2, 3, 4]

# Modification
numbers.append(6)         # Add to end: [1, 2, 3, 4, 5, 6]
numbers.extend([7, 8])    # Add multiple: [1, 2, 3, 4, 5, 6, 7, 8]
numbers.insert(1, 1.5)    # Insert at position: [1, 1.5, 2, 3, 4, 5, 6, 7, 8]

# List Comprehensions
double = [x * 2 for x in numbers]              # Create new list with double the values

In [536]:
world_pop = [2525779, 3026003, 3691173, 4449049, 5320817, 6127700, 6916183]
world_pop

[2525779, 3026003, 3691173, 4449049, 5320817, 6127700, 6916183]

In [537]:
pop_first = [2525779, 3026003, 3691173]
pop_second = [4449049, 5320817, 6127700, 6916183]
pop_all = pop_first + pop_second
pop_all

[2525779, 3026003, 3691173, 4449049, 5320817, 6127700, 6916183]

In [538]:
# Python uses zero-based indexing
world_pop[0] # the first observation

2525779

In [539]:
world_pop[1] # the second observation

3026003

In [540]:
world_pop[-1] # the last observation

6916183

In [541]:
# Python uses "up to but not including" slicing semantics
world_pop[0:4] # the first four observations

[2525779, 3026003, 3691173, 4449049]

In [542]:
world_pop[:4] # an alternative was to slice the first four observations

[2525779, 3026003, 3691173, 4449049]

In [543]:
# How many observations are in the list?
len(world_pop)

7

In [544]:
# return a sequence of decades as a list using range(start, stop, step)
list(range(1950, 2011, 10)) # specify 2011 to include 2010

[1950, 1960, 1970, 1980, 1990, 2000, 2010]

In [545]:
# A list can contain different data types
mixed_list = [10, 10.5, True, 'USA', 'Canada']
mixed_list

[10, 10.5, True, 'USA', 'Canada']

In [546]:
# Lists are mutable
mixed_list[4] = '7'
mixed_list

[10, 10.5, True, 'USA', '7']

In [547]:
numbers

# sum function
sum(numbers)
# min function
min(numbers)
# index function
list(numbers)[2]  # Find the index of value 3 in the list
numbers = list(numbers)  # Convert to list if it's not already

In [548]:
# Sorting and Filtering
numbers.sort()                # Sort in place
sorted_numbers = sorted(numbers)  # Create new sorted list
numbers.reverse()            # Reverse in place

In [549]:
mixed_list.append('Canada') # append 'Canada' to the end of the list
mixed_list

[10, 10.5, True, 'USA', '7', 'Canada']

In [550]:
sorted_list = sorted(numbers, reverse = False) # sort numbers in ascending order, reverse = True for descending order

sorted_list

[1, 1.5, 2, 3, 4, 5, 6, 7, 8]

Built-in Python data structures are generally not vectorized. For example, multiplying world_pop by 2 will concatenate the list twice, rather than multiply each element by 2.

In [551]:
world_pop*2 #vectorized means each element in the list is multiplied by 2

[2525779,
 3026003,
 3691173,
 4449049,
 5320817,
 6127700,
 6916183,
 2525779,
 3026003,
 3691173,
 4449049,
 5320817,
 6127700,
 6916183]

In [552]:
# We can use a 'list comprehension' to perform element-wise arithmetic
pop_million = [i / 1000 for i in world_pop] # this creates a new list where each element in world_pop is divided by 1000
pop_million

[2525.779, 3026.003, 3691.173, 4449.049, 5320.817, 6127.7, 6916.183]

x = [1, 2, 3] is a list.
- sum(x) computes the sum of all elements in a list
- max(x) computes the maximum value in a list
- .index(value) finds the index of the first occurrence of a value in a list
- list comprehension : [var for var in list if condition/in list]
- list comprehension with transformation: [transformation(var) for var in list if condition/in list]
- list comprehension creates a new list by iterating through an existing list and applying a condition or transformation to each element.
- .sort(x) sorts a list in place
- .sorted(x, reverse=False) creates a new sorted list from the original list, reverse=True for descending order

In [553]:
### EXERCISE ###

# Monthly revenue data (in thousands)
monthly_revenue = [145, 132, 165, 175, 156, 148]

# Tasks:
# 1. Calculate the total revenue
# Hint: Use sum()
sum(monthly_revenue) * 1000 #output: 921000

# 2. Find the month number with highest revenue (remember 0-based indexing!)
# Hint: There's a method to find the index of a value
monthly_revenue.index(max(monthly_revenue)) #output: 3

# 3. Create a new list with only revenues above 150
# Hint: Use list comprehension as shown in notebook
revenue_above_150 = [i for i in monthly_revenue if i > 150]

# 4. [New] Sort the revenues in descending order without modifying
# the original list
# Hint: Use the sorted() function - it's like .sort() but creates a new list
sorted_revenue = sorted(monthly_revenue, reverse=True)

In [554]:
### Another example ###

temperatures = [32, 25, 28, 30, 35, 27, 29]

# Convert all temperatures to Fahrenheit
fahrenheit_temps = [(t * 9/5 + 32) for t in temperatures]
print("F:", fahrenheit_temps)

F: [89.6, 77.0, 82.4, 86.0, 95.0, 80.6, 84.2]

We will use pandas and numpy to conduct vectorized operations. Nevertheless, list comprehensions are very useful for returning observations that meet certain conditions.

In [555]:
# return strings from mixed_list
print(mixed_list)

[item for item in mixed_list if isinstance(item, str)]
# isinstance() checks if an item is of a specified type (e.g., str for string, int for integer)
# isinstance(obj, type)

[10, 10.5, True, 'USA', '7', 'Canada']

['USA', '7', 'Canada']

**Dictionary**

In [556]:
# Creation
person = {
    'name': 'John',
    'age': '7',
    'city': 'New York'
}

# Accessing and Modifying
name = person['name']        # Get value by key
person['age'] = 31           # Update value
person['email'] = 'j@ex.com' # Add new key-value pair

# Safe Access
age = person.get('age', 8)   # Get with default value
# .get() returns the value for the specified key if the key is in the dictionary. 
# If not, it returns the default value provided (in this case, it returns 8)
has_email = 'email' in person  # Check key existence, returns True or False

# Methods
keys = person.keys()         # Get all keys
values = person.values()     # Get all values
items = person.items()       # Get all key-value pairs

In [557]:
person.values()

dict_values(['John', 31, 'New York', 'j@ex.com'])

In [558]:
# dictionaries are key-value pairs; they need not be ordered
world_pop_dict = {'1950': 2525779, '1960': 3026003, '1970': 3691173,
                  '1980': 4449049, '1990': 5320817, '2000': 6127700}
world_pop_dict

{'1950': 2525779,
 '1960': 3026003,
 '1970': 3691173,
 '1980': 4449049,
 '1990': 5320817,
 '2000': 6127700}

In [559]:
world_pop_dict['1990'] # get value for key '1990'

5320817

In [560]:
# add a new key-value pair
world_pop_dict['2010'] = 6916183 
world_pop_dict

{'1950': 2525779,
 '1960': 3026003,
 '1970': 3691173,
 '1980': 4449049,
 '1990': 5320817,
 '2000': 6127700,
 '2010': 6916183}

In [561]:
# return the keys
world_pop_dict.keys()

dict_keys(['1950', '1960', '1970', '1980', '1990', '2000', '2010'])

In [562]:
# return the values
world_pop_dict.values()

dict_values([2525779, 3026003, 3691173, 4449049, 5320817, 6127700, 6916183])

In [563]:
# return the values as a list
list(world_pop_dict.keys())

['1950', '1960', '1970', '1980', '1990', '2000', '2010']

In [564]:
# Dictionary Comprehension

world_pop_dict = {
    'China': 1412000000,
    'India': 1380000000,
    'USA': 331000000,
    'Indonesia': 273500000,
    'Pakistan': 225200000
}

# Creating a new dictionary from an existing one
millions_pop = {country: pop / 1000000 for country, pop in world_pop_dict.items()}

millions_pop

{'China': 1412.0,
 'India': 1380.0,
 'USA': 331.0,
 'Indonesia': 273.5,
 'Pakistan': 225.2}

In [565]:
# Dictionary comprehension with a condition
large_countries = {country: pop for country, pop in world_pop_dict.items() if pop > 300000000}

print(large_countries)

{'China': 1412000000, 'India': 1380000000, 'USA': 331000000}

In [566]:
### EXERCISE ###

# Product inventory
inventory = {
    'laptop': 850,
    'mouse': 25,
    'keyboard': 75,
    'monitor': 275
}

# Tasks:
# 1. Print all product names
# Hint: Use the keys() method
inventory.keys()

# 2. Find the most expensive product
# Hint: Use max() with values
most_expensive = max(inventory, key=inventory.get) # output: 'laptop'
print(f"Most expensive product: {most_expensive} (${inventory[most_expensive]})")

#.get() retrieves the value for the specified key from the dictionary.

# 3. Add a new product 'headphones' with price 55
# Hint: Use simple assignment
inventory['headphones'] = 55

# 4. [New] Create a dictionary of only products under 100
# using dictionary comprehension
# Hint: The syntax is similar to list comprehension but with key:value pairs and {}
under_100 = {product: price for product, price in inventory.items() if price < 100}
print(under_100) # output: {'mouse': 25, 'keyboard': 75, 'headphones': 55}

Most expensive product: laptop ($850)
{'mouse': 25, 'keyboard': 75, 'headphones': 55}

**Tuple**

In [567]:
# Creation
point = (3, 4) # Python knows it's a tuple because of round brackets
person = ('Hello', 30, 'Singapore')

# Access and Unpacking
x = point[0]               # Access by index # output : 3
x, y = point              # Tuple unpacking # output : (3, 4)
name, age, city = person  # Multiple assignment # name = 'Hello', age = 30, city = 'Singapore'

# Methods
count = person.count('John')  # Count occurrences 
index = person.index(30)      # Find position

# Common Uses
def get_coordinates():
    return (3, 4)  # Return multiple values

x, y = get_coordinates()  # Unpack returned tuple

In [568]:
# We cannot change the values of a tuple; it will raise an error
point[0] = 5  # This will raise a TypeError

TypeError: 'tuple' object does not support item assignment

**Set**

In [ ]:
# Creation
fruits = {'apple', 'banana', 'orange'}
numbers = set([1, 2, 2, 3, 3, 4])  # Creates {1, 2, 3, 4}

# set() removes duplicates from the list and creates a set of unique elements

# Set Operations
a = {1, 2, 3}
b = {3, 4, 5}
union = a | b                # Elements in either (1, 2, 3, 4, 5)
intersection = a & b         # Elements in both (3)
difference = a - b           # Elements in a but not b (1, 2)
symmetric_diff = a ^ b       # Elements in either but not both (1, 2, 4, 5)

# Modifications
fruits.add('grape')          # Add single element
fruits.update(['mango', 'kiwi'])  # Add multiple elements
fruits.remove('apple')       # Remove element (raises error if not found)
fruits.discard('apple')      # Remove element (no error if not found)

In [ ]:
a - b # set difference: elements in a but not in b

{1, 2}

In [ ]:
### EXAMPLE ###

store_a = {'laptop', 'keyboard', 'mouse', 'monitor'}
store_b = {'laptop', 'headphones', 'mouse', 'camera'}

# Tasks:
# 1. Find common products
common = store_a & store_b  

# 2. List all products in both stores ("or")
all_products = store_a | store_b  

# 3. List store A unique products
store_a_unique = store_a - store_b  # {'keyboard', 'monitor'}

In [ ]:
store_b - store_a

{'camera', 'headphones'}

### Pandas Data Structures: Series and DataFrames

**Series**

In [ ]:
import pandas as pd #this is a common importing standard for pandas

In [ ]:
# Import pandas - this gives us tools for data manipulation
import pandas as pd

# A Series is like a special column in a spreadsheet

# It has two parts:
# 1. Values (the actual data)
# 2. Index (labels for each value)

# Create a Series of student test scores
# Each student (a through e) has a score (1 through 5)
student_scores = pd.Series(
   data=[1, 2, 3, 4, 5],
   index=['a', 'b', 'c', 'd', 'e']
)

In [ ]:
# Access values in different ways:

# Get one student's score using their label
score_a = student_scores['a']  # Gets score for student 'a'

In [ ]:
# Get a score using its position (like a regular list)
first_score = student_scores[0]  # Gets the first score

/var/folders/jn/k87rrm694dq263mh4gqmfd080000gn/T/ipykernel_45030/3917056612.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  first_score = student_scores[0]  # Gets the first score

In [ ]:
# Get multiple scores at once
selected_scores = student_scores[['a', 'c']]  # Gets scores for students 'a' and 'c'

selected_scores

a    1
c    3
dtype: int64

In [ ]:
# Perform calculations on all scores at once
bonus_scores = student_scores + 2  # Add 2 points to every score

bonus_scores

a    3
b    4
c    5
d    6
e    7
dtype: int64

In [ ]:
# Filter scores based on conditions
high_scores = student_scores[student_scores != 3]  # Find all scores above 3

high_scores

# boolean arrays T F

a    1
b    2
d    4
e    5
dtype: int64

In [ ]:
# Calculate summary statistics
average = student_scores.mean()
highest = student_scores.max()
lowest = student_scores.min()

average

np.float64(3.0)

In [ ]:
# Operations
doubled = student_scores * 2             # Vectorized operations

doubled

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [ ]:
filtered = student_scores[student_scores > 2]   

filtered
# Boolean filtering

c    3
d    4
e    5
dtype: int64

In [ ]:

# a series is a vector with an index
world_pop_s = pd.Series(world_pop)
world_pop_s

0    2525779
1    3026003
2    3691173
3    4449049
4    5320817
5    6127700
6    6916183
dtype: int64

In [ ]:
# selection and slicing are similar to lists
world_pop_s[1]

np.int64(3026003)

In [ ]:
world_pop_s[:4]

0    2525779
1    3026003
2    3691173
3    4449049
dtype: int64

In [ ]:
# select non-consecutive observations
world_pop_s[[0, 2]]

0    2525779
2    3691173
dtype: int64

In [ ]:
# select everything except the third observation
world_pop_s.drop(2)

# drop() returns a new Series with the specified index removed.

0    2525779
1    3026003
3    4449049
4    5320817
5    6127700
6    6916183
dtype: int64

In [ ]:
# select everything except the last observation
world_pop_s[:-1]

0    2525779
1    3026003
2    3691173
3    4449049
4    5320817
5    6127700
dtype: int64

In [ ]:
# series are vectorized, they operate element-wise
pop_million = world_pop_s / 1000
world_pop_s
pop_million

0    2525.779
1    3026.003
2    3691.173
3    4449.049
4    5320.817
5    6127.700
6    6916.183
dtype: float64

In [ ]:
pop_rate = world_pop_s / world_pop_s[0]
pop_rate

0    1.000000
1    1.198047
2    1.461400
3    1.761456
4    2.106604
5    2.426063
6    2.738238
dtype: float64

Vector arithmetic with series requires that the indices match. One way to ensure this is to reset the index after slicing the series. Specify `drop=True` in `reset_index` to avoid adding the old index as a column.

In [ ]:
temperatures = pd.Series([20, 22, 25, 23, 21], index=['Mon', 'Tue', 'Wed', 'Thu', 'Fri'])

temps_without_monday = temperatures.drop('Mon')
temps_without_friday = temperatures.drop('Fri')

temps_without_monday - temps_without_friday

# df.reset_index(drop=True, inplace = True) removes old index and creates a new sequential index
# df.reset_index(drop=False) keeps the old index as a new column and creates a new sequential index


# reassigns a clean sequential index to DF or Series
# after dropping values, the index does not automatically reset

Fri    NaN
Mon    NaN
Thu    0.0
Tue    0.0
Wed    0.0
dtype: float64

In [ ]:
#### This function is doing the exact same

pop_increase = world_pop_s.diff()

pop_increase

# .diff() computes the difference between each element and its previous in the Series.

0         NaN
1    500224.0
2    665170.0
3    757876.0
4    871768.0
5    806883.0
6    788483.0
dtype: float64

In [ ]:
percent_increase = pop_increase / world_pop_s * 100
percent_increase

0          NaN
1    16.530849
2    18.020559
3    17.034562
4    16.384100
5    13.167795
6    11.400551
dtype: float64

In [ ]:
import pandas as pd

# .pct_change() calculates the percentage change between the current and its previous element.
# .diff calculates the difference between the current and its previous element.
world_pop_s.pct_change()
world_pop_s.diff()

0         NaN
1    500224.0
2    665170.0
3    757876.0
4    871768.0
5    806883.0
6    788483.0
dtype: float64

In [ ]:
### EXERCISE ###

import pandas as pd
import numpy as np

sales = pd.Series([150, 180, 165, 145, 190, 170], 
                  index=['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun'])

# Tasks:
# 1. Calculate average monthly sales
sales.mean() # output: 166.66666666666666
np.mean(sales) # output: 166.66666666666666 

# 2. Find months with sales above 170
# Hint: Use boolean indexing
sales[sales > 170]


# 3. Calculate the difference between each month's sales
# Hint: Use the diff() method as above
sales.diff()

# 4. [New] Calculate cumulative sales by month
# Hint: Use the cumsum() method - it adds up values cumulatively
# # Check pd.Series.cumsum? if in doubt

# .cumsum calculates a running total (adds each value to the sum of all previous values)

# axis = 0 sums down the rows, axis = 1 sums across the columns
# skipna = True ignores NaN values when performing the calculation

sales.cumsum(axis = 0, skipna = True)

Jan     150
Feb     330
Mar     495
Apr     640
May     830
Jun    1000
dtype: int64

**DataFrame**

In [ ]:
# DataFrame with Singapore retail malls
df = pd.DataFrame({
    'mall_name': ['Ion Orchard', 'VivoCity', 'Suntec City', 'Nex', 'Tampines Mall'],
    'region': ['Central', 'South', 'Central', 'North East', 'East'],
    'shops': [300, 280, 350, 340, 230],
    'parking_lots': [1200, 2179, 3200, 1300, 800],
    'daily_footfall': [45000, 38000, 42000, 35000, 28000]  # Average daily visitors
})

print(df)

       mall_name      region  shops  parking_lots  daily_footfall
0    Ion Orchard     Central    300          1200           45000
1       VivoCity       South    280          2179           38000
2    Suntec City     Central    350          3200           42000
3            Nex  North East    340          1300           35000
4  Tampines Mall        East    230           800           28000

In [ ]:
df['mall_name'] # returns a Series

0      Ion Orchard
1         VivoCity
2      Suntec City
3              Nex
4    Tampines Mall
Name: mall_name, dtype: object

In [ ]:
df['daily_footfall']

0    45000
1    38000
2    42000
3    35000
4    28000
Name: daily_footfall, dtype: int64

In [ ]:
type(malls)

pandas.core.series.Series

In [ ]:
type(df['mall_name']) # output: pandas.core.series.Series

pandas.core.series.Series

In [ ]:
# Basic Selection
malls = df['mall_name']                    # Select mall names
visitors = df['daily_footfall']            # Select visitor numbers

#type(malls)

df.head()

       mall_name      region  shops  parking_lots  daily_footfall
0    Ion Orchard     Central    300          1200           45000
1       VivoCity       South    280          2179           38000
2    Suntec City     Central    350          3200           42000
3            Nex  North East    340          1300           35000
4  Tampines Mall        East    230           800           28000

In [ ]:
# Select multiple columns
location_info = df[['mall_name', 'region', 'shops']] # selecting a list of cols

location_info

       mall_name      region  shops
0    Ion Orchard     Central    300
1       VivoCity       South    280
2    Suntec City     Central    350
3            Nex  North East    340
4  Tampines Mall        East    230

In [ ]:
# Row selection by index "label"
mall_info1 = df.loc[0]  
mall_info2 = df.loc[1] 

print(mall_info1)

mall_name         Ion Orchard
region                Central
shops                     300
parking_lots             1200
daily_footfall          45000
Name: 0, dtype: object

In [ ]:
type(mall_info1)

pandas.core.series.Series

In [ ]:
# Filtering Operations
# Find malls with >40k daily visitors
high_traffic = df[df['daily_footfall'] > 40000]

high_traffic

     mall_name   region  shops  parking_lots  daily_footfall
0  Ion Orchard  Central    300          1200           45000
2  Suntec City  Central    350          3200           42000

In [ ]:
# Find malls in Central region
not_central_malls = df[df['region'] != 'Central']

not_central_malls

       mall_name      region  shops  parking_lots  daily_footfall
1       VivoCity       South    280          2179           38000
3            Nex  North East    340          1300           35000
4  Tampines Mall        East    230           800           28000

In [ ]:
# Calculations
# Add new column for shops per 1000 visitors
df['shops_per_visitor'] = (df['shops'] / df['daily_footfall'] * 1000)
df

,mall_name,region,shops,parking_lots,daily_footfall,shops_per_visitor
0,Ion Orchard,Central,300,1200,45000,6.666667
1,VivoCity,South,280,2179,38000,7.368421
2,Suntec City,Central,350,3200,42000,8.333333
3,Nex,North East,340,1300,35000,9.714286
4,Tampines Mall,East,230,800,28000,8.214286

In [ ]:
# Grouping and Aggregation
# Average footfall by region
avg_by_region = df.groupby('region')['daily_footfall'].mean() #.round(0)
# mean of footfall by region
avg_by_region

region
Central       43500.0
East          28000.0
North East    35000.0
South         38000.0
Name: daily_footfall, dtype: float64

In [ ]:
# Total shops by region
shops_by_region = df.groupby('region')['shops'].mean().round(0)
# mean of shop by region
shops_by_region

region
Central       325.0
East          230.0
North East    340.0
South         280.0
Name: shops, dtype: float64

In [ ]:
world_pop = [2525779, 3026003, 3691173, 4449049, 5320817, 6127700, 6916183]
world_pop

world_pop_df = pd.DataFrame(
    # build the data frame from a dictionary of lists
    {'year': list(range(1950, 2011, 10)),
    'pop': world_pop}
)

world_pop_df

   year      pop
0  1950  2525779
1  1960  3026003
2  1970  3691173
3  1980  4449049
4  1990  5320817
5  2000  6127700
6  2010  6916183

In [ ]:
world_pop_df.columns
# this gives you column names

Index(['year', 'pop'], dtype='object')

In [ ]:
world_pop_df.shape
# (rows, cols)

(7, 2)

In [ ]:
world_pop_df.describe()
# summary statistics

              year           pop
count     7.000000  7.000000e+00
mean   1980.000000  4.579529e+06
std      21.602469  1.625004e+06
min    1950.000000  2.525779e+06
25%    1965.000000  3.358588e+06
50%    1980.000000  4.449049e+06
75%    1995.000000  5.724258e+06
max    2010.000000  6.916183e+06

In [ ]:
# display the summary as integers
world_pop_df.describe().astype(int)

       year      pop
count     7        7
mean   1980  4579529
std      21  1625003
min    1950  2525779
25%    1965  3358588
50%    1980  4449049
75%    1995  5724258
max    2010  6916183

In [ ]:
# extract the 'pop' column; returns a series
world_pop_df['pop']

0    2525779
1    3026003
2    3691173
3    4449049
4    5320817
5    6127700
6    6916183
Name: pop, dtype: int64

In [ ]:
import pandas as pd # pandas ignores NA values by default

world_pop_df.mean().round(0)

year       1980.0
pop     4579529.0
dtype: float64

In [ ]:
# we can override this behavior
world_pop_df.mean(skipna=False)
# this will return NaN if there are any NA values

year    1.980000e+03
pop     4.579529e+06
dtype: float64

In [ ]:
world_pop = world_pop_df['pop']
world_pop

0    2525779
1    3026003
2    3691173
3    4449049
4    5320817
5    6127700
6    6916183
Name: pop, dtype: int64

In [ ]:
len(world_pop)

7

In [ ]:
type(world_pop)

pandas.core.series.Series

In [ ]:
# Methods are functions that are attached to objects
world_pop.min() # Access methods using the dot notation

2525779

In [ ]:
world_pop.mean().round(2)

np.float64(4579529.14)

In [ ]:
world_pop.sum() / len(world_pop)
# this gives the same result as mean()

np.float64(4579529.142857143)

In [ ]:
world_pop

0    2525779
1    3026003
2    3691173
3    4449049
4    5320817
5    6127700
6    6916183
Name: pop, dtype: int64

In [ ]:
### EXERCISE: Properties ###

# Below is a DataFrame of HDB resale transactions
property_data = pd.DataFrame({
    'town': ['Punggol', 'Tampines', 'Sengkang', 'Punggol', 'Sengkang', 'Tampines'],
    'flat_type': ['4-Room', '5-Room', '4-Room', '3-Room', '5-Room', '4-Room'],
    'floor_area': [95, 120, 93, 68, 118, 90],  # square meters
    'price': [480000, 588000, 455000, 380000, 598000, 465000],
    'age': [8, 15, 10, 5, 12, 18]  # years
})

# Tasks:
# 1. Calculate price per square meter for each flat
#    Create a new column 'price_per_sqm'
property_data['price_per_sqm'] = property_data['price'] / property_data['floor_area']
# 2. Find the average price for each town
#    Hint: Use groupby()
property_data.groupby('town')['price'].mean()

# 3. Filter and show only flats that are:
#    - Less than 10 years old AND
#    - Larger than 100 square meters
#    Hint: Use multiple conditions
property_data[(property_data['age']<10) & (property_data['floor_area']>100)]

# df[df['age'] < 10] 
# df[(df['age'] < 10) & (df['floor_area'] > 100)]

# 4. For each flat_type, calculate:
#    - Average price
#    - Average floor area
#    - Count of flats
#    Hint: Use groupby() with multiple aggregations
property_data.groupby('flat_type')['price'].mean()
property_data.groupby('flat_type')['floor_area'].mean()
property_data.groupby('flat_type')['flat_type'].count()

# OR AGG
property_data.groupby('flat_type').agg({
    'price': 'mean',
    'floor_area': 'mean',
    'flat_type': 'count'
})

# multiple agg
# df.groupby('department').agg({
#     'salary': ['mean', 'max', 'min', lambda x: x.max() - x.min()],
#     'age' : ['median', 'mean', 'count', 'sum']
# })

# multiple agg with lambda functions
# df.groupby('department').agg({
#     'salary': ['mean', lambda x: x.max() - x.min()],
#     'age' : lambda x: [x.median(), x.mean()]
# })

# this gives mean salary, range of salary, median age, mean age by department

# What is .agg()?
# It allows you to apply multiple aggregation functions to different columns in a DataFrame.
# You pass a dictionary where keys are column names and values are the aggregation functions to apply.
# For example, in the code above:
# - 'price': 'mean' calculates the average price for each flat_type.
# - 'floor_area': 'mean' calculates the average floor area for each flat_type.
# - 'flat_type': 'count' counts the number of entries for each flat_type.
# The result is a new DataFrame with the aggregated values.
# This is useful for summarizing data in a concise way.

# 5. Sort the flats by price in descending order and 
#    show only the top 3 most expensive flats
#    Hint: Use sort_values() and head()
property_data.sort_values(by='price', ascending=False).head(3)

# df.sort_values(by='col_name', ascending = True)
# df.sort_values(by=['age','salary'], ascending = [True, False], na_position='first')
# this sorts first by age ascending, then sorts by salary descending if there is a tie for ages
# na_position decides where the nan appears, top or bottom, default is bottom

flat_type
3-Room    1
4-Room    3
5-Room    2
Name: flat_type, dtype: int64

In [ ]:
property_data

       town flat_type  floor_area   price  age
0   Punggol    4-Room          95  480000    8
1  Tampines    5-Room         120  588000   15
2  Sengkang    4-Room          93  455000   10
3   Punggol    3-Room          68  380000    5
4  Sengkang    5-Room         118  598000   12
5  Tampines    4-Room          90  465000   18

In [577]:
##### Data Cleaning Cheat Sheet #####

import pandas as pd
import numpy as np

# messy dataset
df = pd.DataFrame({
    'name': ['John ', ' Jane', 'Bob', ' Sarah ', np.nan],
    'age': ['25', '30', 'unknown', '35', '40'],
    'salary': ['50000', '60,000', '75000.0', np.nan, '90000'],
    'date_joined': ['2020-01-01', '01/15/2020', '2020/02/01', '02-15-2020', None],
    'department': ['IT', 'it', 'HR', 'hr', 'Marketing']
})

# 1. Missing Values
# Check what's missing
missing_values = df.isnull().sum()

# Fill missing values
df['name'] = df['name'].fillna('Unknown')  # Replace with specific value

# 2. Data Type Conversion
# Convert salary to numeric by removing commas first
df['salary'] = (df['salary'].str.replace(',', '')  # Remove commas
                          .astype(float))           # Convert to float

# Convert age to numeric, marking errors as NaN
df['age'] = pd.to_numeric(df['age'], errors='coerce')


# 3. Duplicate Handling
# Check for and remove duplicates
df = df.drop_duplicates()

# 6. Value Standardization
# Standardize department names
dept_mapping = {
    'it': 'Information Technology',
    'hr': 'Human Resources',
    'marketing': 'Marketing'
}
df['department'] = df['department'].map(dept_mapping)

# 7. Derived Features

# Create salary bands
df['salary_category'] = pd.cut(
    df['salary'],
    bins=[0, 55000, 75000, float('inf')],
    labels=['Entry', 'Mid', 'Senior']
)

# Example of filtering rows based on conditions
high_salary = df[df['salary'] > 70000]

# Example of groupby operations after cleaning
dept_summary = df.groupby('department').agg({
    'salary': ['mean', 'min', 'max'],
    'age': 'mean',
    'name': 'count'
}).round(2)

dept_summary

                         salary                     age  name
                           mean      min      max  mean count
department
Human Resources             NaN      NaN      NaN  35.0     1
Information Technology  60000.0  60000.0  60000.0  30.0     1